group-reports/shahriar-1-2-tests/first-results/disk-throughput-tuning-protocol-B/test-2.txt
write-sequentially-test-job: (g=0): rw=write, bs=(R) 4096KiB-4096KiB, (W) 4096KiB-4096KiB, (T) 4096KiB-4096KiB, ioengine=libaio, iodepth=16
fio-3.7
Starting 1 process
write-sequentially-test-job: Laying out IO file (1 file / 10240MiB)

write-sequentially-test-job: (groupid=0, jobs=1): err= 0: pid=32186: Sat Jul  8 13:39:50 2023
  write: IOPS=5, BW=22.9MiB/s (23.0MB/s)(13.5GiB/602743msec)
    slat (usec): min=130, max=12940, avg=388.37, stdev=641.47
    clat (msec): min=223, max=5244, avg=2794.20, stdev=158.76
     lat (msec): min=224, max=5244, avg=2794.60, stdev=158.75
    clat percentiles (msec):
     |  1.00th=[ 2567],  5.00th=[ 2702], 10.00th=[ 2769], 20.00th=[ 2802],
     | 30.00th=[ 2802], 40.00th=[ 2802], 50.00th=[ 2802], 60.00th=[ 2802],
     | 70.00th=[ 2802], 80.00th=[ 2802], 90.00th=[ 2802], 95.00th=[ 2869],
     | 99.00th=[ 2970], 99.50th=[ 3473], 99.90th=[ 4732], 99.95th=[ 5067],
     | 99.99th=[ 5269]
   bw (  KiB/s): min= 8143, max=40960, per=99.86%, avg=23398.55, stdev=4567.27, samples=1200
   iops        : min=    1, max=   10, avg= 5.32, stdev= 1.22, samples=1200
  lat (msec)   : 250=0.03%, 500=0.06%, 750=0.06%
  cpu          : usr=0.76%, sys=0.20%, ctx=3556, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.2%, 16=99.6%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,3448,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=22.9MiB/s (23.0MB/s), 22.9MiB/s-22.9MiB/s (23.0MB/s-23.0MB/s), io=13.5GiB (14.5GB), run=602743-602743msec

Disk stats (read/write):
    drbd1: ios=0/17279, merge=0/0, ticks=0/47487473, in_queue=47487473, util=99.48%, aggrios=0/17306, aggrmerge=0/0, aggrticks=0/42719422, aggrin_queue=42719422, aggrutil=75.14%
    dm-0: ios=0/17306, merge=0/0, ticks=0/42719422, in_queue=42719422, util=75.14%, aggrios=0/17303, aggrmerge=0/3, aggrticks=0/42711171, aggrin_queue=42702431, aggrutil=75.14%
  vdb: ios=0/17303, merge=0/3, ticks=0/42711171, in_queue=42702431, util=75.14%